In [1]:
from app.data.sql_util import read_sql

In [2]:
df = read_sql('select * from member')
df.head()

   id employee_id name             reg_date
0   1      101001  박종욱  2025-09-18 14:09:01
1   2      101002  강경란  2025-09-18 14:09:01
2   3      101003  김나래  2025-09-18 14:09:01
3   4      101004  이재진  2025-09-18 14:09:01
4   5      101005  이진섭  2025-09-18 14:09:01

In [6]:
df.to_dict(orient='records')

[{'id': 1,
  'employee_id': '101001',
  'name': '박종욱',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 2,
  'employee_id': '101002',
  'name': '강경란',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 3,
  'employee_id': '101003',
  'name': '김나래',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 4,
  'employee_id': '101004',
  'name': '이재진',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 5,
  'employee_id': '101005',
  'name': '이진섭',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 6,
  'employee_id': '101006',
  'name': '장찬영',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 7,
  'employee_id': '101007',
  'name': '전민우',
  'reg_date': '2025-09-18 14:09:01'},
 {'id': 8,
  'employee_id': '101008',
  'name': '차요준',
  'reg_date': '2025-09-18 14:09:01'}]

In [8]:
import json
with open('./member.json','w') as f:
    json.dump(df.to_dict(orient='records'), f, indent=4)